{"01. Introduction": {"01. What is 1SRE?.md": "<h1 align=\"center\">What is 1SRE?</h1></center>\n\n1SRE is a platform to learn about anything OS, networking, or other core operational related content for <b>free</b>; the objective of this application is to give college students, experienced professionals, and whomever else the necesseary tools to become a Site Reliability Engineer (or anything similar).\n\nThere are a lot of platforms for (general) software engineers to build their confidence in programming (i.e.: [Leetcode](https://leetcode.com/), [HackerRank](https://www.hackerrank.com/), [NeetCode](https://neetcode.io/), etc); however, there's nothing that covers concepts about OS (operating systems), the Kernel, networks (TCP/UDP/POP/FTP/etc), Ansible, CI/CD, and other buzz words in operational roles. Sure, it's possible to find manuals that cover each of these topics in depth by simply Googling them, but the purpose of 1SRE is to combine everything and spit it out onto one <i>source of truth</i>.\n\nIf anything, at the end of the day, the platform is truly meant for myself. My kind of work revolves around reilability engineering and I'm typically learning more things as I go; one day, I thought to myself that it'd be nice to have a little website to go back to whenever I needed the information (either for work or for general interview prep)...\n\nIf you find anything that needs to be corrected, please submit a PR request and I'll look at it when I get the chance. Whatever I write about is through experience or research, but I know with technology constantly changing, there's always a better or efficient approach to a problem or question.\n\nLastly, thank you so much for giving this a read. I'm excited to work on this platform moving forward and I hope to make a significant impact within the community.", "02. Where to get started?.md": "<h1 align=\"center\">Where to get started?</h1></center>\n\nTo cut it short, there's no proper way to go about reading the documents found on the website/[GitHub](https://github.com/1SRE/Manual); it's really up to you, the user, to dive anywhere across the vast amount of resources provided to you.\n\nThe way I plan on organizing the documents is to cover each topic at a very high level, but also work my way down to the intricacies of each topic (i.e.: starting in Linux in general then going into distrubutions, the Kernel, a typical boot sequence, etc).\n\nAs you can tell, the plan is somewhat disorganized for now, but eventually there'll be more consistency throughout the documents.\n\nFor the time being, the outline is as follows:\n\n|Topics|\n|--|\n|Operating Systems|\n|CI/CD|\n|Networking|\n|Scripting|\n|Infrastructure as code|\n|System Design|\n|more to come 😛|", "03. Future plans.md": "<h1 align=\"center\">Future plans</h1></center>\n\nThe plan for now is to create documents and setup a pipeline to automatically display them as intended on 1SRE's website (at the time of writing, the domain hasn't been purchased yet 😬... If it does get purchased, I'll just think of another name and go with that)\n\nFuture plans consist of:\n- Video demonstrations\n- Free labs\n- Premium features\n- Discord community\n- Please make a PR with more things that I can write here.. credit will be given 😛"}, "02. Operating Systems": {"01. Linux": {"01. What is Linux?.md": "asdf"}, "02. Windows": {"01. What is Windows?.md": ""}}, "03. Networking": {}, "04. Automation": {}, "04. Infrastructure as Code": {}, "System-Design": {}}