{"06. Code Management": {"What is Git?.md": "<h1 align=\"center\">What is Git?</h1></center>\n\nDirectly from [Git's website](https://git-scm.com/)\n> Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency. Git is easy to learn and has a tiny footprint with lightning fast performance. It outclasses SCM tools like Subversion, CVS, Perforce, and ClearCase with features like cheap local branching, convenient staging areas, and multiple workflows.\n\nHonestly, I don't plan on adding much to this subfolder. I use Git 99.9% of the time at work and most of the commands are muscle memory at this point; however, there are still some commands I simply don't use b/c I never found them to be useful (i.e.: `git rebase`)\n\n[Cheat sheet](https://education.github.com/git-cheat-sheet-education.pdf)"}, "01. Introduction": {"02. Where to get started?.md": "<h1 align=\"center\">Where to get started?</h1></center>\n\nTo cut it short, there's no proper way to go about reading the documents found on the website/[GitHub](https://github.com/1SRE/Manual); it's really up to you, the user, to dive anywhere across the vast amount of resources provided to you.\n\nThe way I plan on organizing the documents is to cover each topic at a very high level, but also work my way down to the intricacies of each topic (i.e.: starting in Linux in general then going into distrubutions, the Kernel, a typical boot sequence, etc).\n\nAs you can tell, the plan is somewhat disorganized for now, but eventually there'll be more consistency throughout the documents.\n\nFor the time being, the outline is as follows:\n\n|Topics|\n|--|\n|Operating Systems|\n|CI/CD|\n|Networking|\n|Scripting|\n|Infrastructure as code|\n|System Design|\n|more to come 😛|", "03. Future plans.md": "<h1 align=\"center\">Future plans</h1></center>\n\nThe plan for now is to create documents and setup a pipeline to automatically display them as intended on 1SRE's website (at the time of writing, the domain hasn't been purchased yet 😬... If it does get purchased, I'll just think of another name and go with that)\n\nFuture plans consist of:\n- Video demonstrations\n- Free labs\n- Premium features\n- Discord community\n- Please make a PR with more things that I can write here.. credit will be given 😛", "01. What is 1SRE?.md": "<h1 align=\"center\">What is 1SRE?</h1></center>\n\n1SRE is a platform to learn about anything OS, networking, or other core operational related content for <b>free</b>; the objective of this application is to give college students, experienced professionals, and whomever else the necesseary tools to become a Site Reliability Engineer (or anything similar).\n\nThere are a lot of platforms for (general) software engineers to build their confidence in programming (i.e.: [Leetcode](https://leetcode.com/), [HackerRank](https://www.hackerrank.com/), [NeetCode](https://neetcode.io/), etc); however, there's nothing that covers concepts about OS (operating systems), the Kernel, networks (TCP/UDP/POP/FTP/etc), Ansible, CI/CD, and other buzz words in operational roles. Sure, it's possible to find manuals that cover each of these topics in depth by simply Googling them, but the purpose of 1SRE is to combine everything and spit it out onto one <i>source of truth</i>.\n\nIf anything, at the end of the day, the platform is truly meant for myself. My kind of work revolves around reilability engineering and I'm typically learning more things as I go; one day, I thought to myself that it'd be nice to have a little website to go back to whenever I needed the information (either for work or for general interview prep)...\n\nIf you find anything that needs to be corrected, please submit a PR request and I'll look at it when I get the chance. Whatever I write about is through experience or research, but I know with technology constantly changing, there's always a better or efficient approach to a problem or question.\n\nLastly, thank you so much for giving this a read. I'm excited to work on this platform moving forward and I hope to make a significant impact within the community."}, "02. Operating Systems": {"02. Windows": {"01. What is Windows?.md": ""}, "01. Linux": {"02. Linux architecture.md": "<h1 align=\"center\">Linux Architecture</h1></center>\n\nYou can break the Linux system architecture into several components; however, the main ones are: hardware, kernel, system libraries, system utilities, desktop environment, and applications layer.\n\n- Hardware layer\n    - Represents the physical hardware components of the computer such as the CPU, memory, and storage.\n- Kernel layer\n    - The kernel is one of the major sections of an OS (operating system). It's responsible for each of the major actions of the Linux OS; the kernel facilitates required abstraction for hiding details of low-level hardware or application programs to the system [credit](https://www.javatpoint.com/architecture-of-linux). Below are some important kernel types which will be referred to later\n        - Monolithic kernel\n        - Micro kernels\n        - Exo kernels\n        - Hybrid kernels\n    - Ultimately, the kernel is what interacts between the barebone hardware and the rest of the applications found on the OS\n- System libraries layer\n    - These libraries include system calls which invoke kernel functions as well as other functionst hat perform tasks such as file manipulation, networking, and memory management [credit](https://tecadmin.net/tutorial/linux-architecture)\n- System utilities layer\n    - Set of programs that perform various system-level tasks such as managing processes, controlling users accounts, and configuring system settings. These utilities are command-line programs that are ran by the user or by other programs\n- Desktop environment layer (OPTIONAL)\n    - This is optional because it's not available everything (for example, there's the general Ubuntu ISO and there's a Ubuntu server ISO which doesn't have GUI access.. the server is all command-line focused where as the former is an image that you can interact with more physically such as clicking on items)\n- Applications layer\n    - Topmost layer of the Linux architecture and consists of the software or other applications (i.e.: Google Chrome, VS Code, Docker)\n\n![img](https://static.javatpoint.com/linux/images/architecture-of-linux.png)\n\n## Hardware Layer - In depth\n\n## Kernel Layer - In depth\n- Overview\n    - The Linux® kernel is the main component of a Linux operating system (OS) and is the core interface between a computer’s hardware and its processes. It communicates between the 2, managing resources as efficiently as possible. The kernel is so named because—like a seed inside a hard shell—it exists within the OS and controls all the major functions of the hardware, whether it’s a phone, laptop, server, or any other kind of computer. [credit](https://www.redhat.com/en/topics/linux/what-is-the-linux-kernel)\n\nThe kernel has four jobs [credit](https://www.redhat.com/en/topics/linux/what-is-the-linux-kernel)\n- Memory management\n    - Keep track of how much memory is used to store what, and where\n- Process management\n    - Determine which processes can use the central processing unit (CPU), when, and for how long\n- Device drivers\n    - Act as mediator/interpreter between the hardware and processes\n- System calls & Security\n    - Receive requests for service from the processes\n\n\n## System Libraries Layer - In depth\n## System Utilities Layer - In depth\n## Desktop Environment Layer - In depth\n## Application Layer - In depth", "03. Boot Sequence.md": "<h1 align=\"center\">Boot Sequence</h1></center>\n\nstuff", "01. What is Linux?.md": "<h1 align=\"center\">What is Linux?</h1></center>\n\n- Open source\n- In many ways, Linux is similar to other operating systems you may have used before, such as Windows, macOS (formerly OS X), or iOS. Like other operating systems, Linux has a graphical interface, and the same types of software you are accustomed to, such as word processors, photo editors, video editors, and so on. In many cases, a software’s creator may have made a Linux version of the same program you use on other systems. In short: if you can use a computer or other electronic device, you can use Linux. [credit](https://opensource.com/resources/linux)\n\n- But Linux also is different from other operating systems in many important ways. First, and perhaps most importantly, Linux is open source software. The code used to create Linux is free and available to the public to view, edit, and—for users with the appropriate skills—to contribute to. [credit](https://opensource.com/resources/linux)\n\n- Linux is also different in that, although the core pieces of the Linux operating system are generally common, there are many distributions of Linux, which include different software options. This means that Linux is incredibly customizable, because not just applications, such as word processors and web browsers, can be swapped out. Linux users also can choose core components, such as which system displays graphics, and other user-interface components. [credit](https://opensource.com/resources/linux)\n\n# Unix vs Linux?\nI've heard of both Unix and Linux, so what the heck is the difference and why are they brought up?\n- Linux is an open-source operating system. This OS is supported on several computer platforms and includes multiple software features that handle computer resources, and allow you to do tasks. This operating system was launched by Linus Torvalds at the University of Helsinki in 1991. [credit](https://byjus.com/gate/difference-between-unix-and-linux/#:~:text=Basic%20Definition-,Linux%20is%20an%20open%2Dsource%20operating%20system.,the%20user%20and%20the%20computer.)\n\n- Unix is a powerful and multitasking operating system that behaves like a bridge between the user and the computer. It allows the user to perform specific functions. This operating system was launched in 1960, and was released by AT&T Bell Labs. [credit](https://byjus.com/gate/difference-between-unix-and-linux/#:~:text=Basic%20Definition-,Linux%20is%20an%20open%2Dsource%20operating%20system.,the%20user%20and%20the%20computer.)\n\nAlas, there's nothing to really be concerned about. Just remember: [Linux refers to the kernel of the GNU/Linux operating system. More generally, it refers to the family of derived distributions](https://www.softwaretestinghelp.com/unix-vs-linux/#Difference_Between_Unix_and_Linux) and [Unix refers to the original operating system developed by AT&T. More generally, it refers to family of derived operating systems.](https://www.softwaretestinghelp.com/unix-vs-linux/#Difference_Between_Unix_and_Linux)\n\nLinux was designed considering UNIX compatability; it's functionality list is quite similar to that of UNIX [credit](https://www.tutorialspoint.com/operating_system/os_linux.htm)\n\n# Linux Architecture\nYou can break the Linux system architecture into several components; however, the main ones are: hardware, kernel, system libraries, system utilities, desktop environment, and applications layer.\n\n- Hardware layer\n    - Represents the physical hardware components of the computer such as the CPU, memory, and storage.\n- Kernel layer\n    - The kernel is one of the major sections of an OS (operating system). It's responsible for each of the major actions of the Linux OS; the kernel facilitates required abstraction for hiding details of low-level hardware or application programs to the system [credit](https://www.javatpoint.com/architecture-of-linux). Below are some important kernel types which will be referred to later\n        - Monolithic kernel\n        - Micro kernels\n        - Exo kernels\n        - Hybrid kernels\n    - Ultimately, the kernel is what interacts between the barebone hardware and the rest of the applications found on the OS\n- System libraries layer\n    - These libraries include system calls which invoke kernel functions as well as other functionst hat perform tasks such as file manipulation, networking, and memory management [credit](https://tecadmin.net/tutorial/linux-architecture)\n- System utilities layer\n    - Set of programs that perform various system-level tasks such as managing processes, controlling users accounts, and configuring system settings. These utilities are command-line programs that are ran by the user or by other programs\n- Desktop environment layer (OPTIONAL)\n    - This is optional because it's not available everything (for example, there's the general Ubuntu ISO and there's a Ubuntu server ISO which doesn't have GUI access.. the server is all command-line focused where as the former is an image that you can interact with more physically such as clicking on items)\n- Applications layer\n    - Topmost layer of the Linux architecture and consists of the software or other applications (i.e.: Google Chrome, VS Code, Docker)\n\n![img](https://static.javatpoint.com/linux/images/architecture-of-linux.png)\n\n## Hardware Layer - In depth\n\n## Kernel Layer - In depth\n- Overview\n    - The Linux® kernel is the main component of a Linux operating system (OS) and is the core interface between a computer’s hardware and its processes. It communicates between the 2, managing resources as efficiently as possible. The kernel is so named because—like a seed inside a hard shell—it exists within the OS and controls all the major functions of the hardware, whether it’s a phone, laptop, server, or any other kind of computer. [credit](https://www.redhat.com/en/topics/linux/what-is-the-linux-kernel)\n\nThe kernel has four jobs [credit](https://www.redhat.com/en/topics/linux/what-is-the-linux-kernel)\n- Memory management\n    - Keep track of how much memory is used to store what, and where\n- Process management\n    - Determine which processes can use the central processing unit (CPU), when, and for how long\n- Device drivers\n    - Act as mediator/interpreter between the hardware and processes\n- System calls & Security\n    - Receive requests for service from the processes\n\n\n## System Libraries Layer - In depth\n## System Utilities Layer - In depth\n## Desktop Environment Layer - In depth\n## Application Layer - In depth"}}}